---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MissingOrInvalidWireSizeTable
source: html/2d17bbc9-f6cb-089a-210a-157587da0636.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MissingOrInvalidWireSizeTable Property

Wire Size Table "[Fail Name]" is missing or invalid. Use Electrical Settings to select a valid Wire Size Table.

## Syntax (C#)
```csharp
public static FailureDefinitionId MissingOrInvalidWireSizeTable { get; }
```